In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv('/Users/marco/Desktop/futuro/full.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,...,Embarked,WikiId,Name_wiki,Age_wiki,Hometown,Boarded,Destination,Lifeboat,Body,Class
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,...,S,691.0,"Braund, Mr. Owen Harris",22.0,"Bridgerule, Devon, England",Southampton,"Qu'Appelle Valley, Saskatchewan, Canada",NaN,NaN,3.0
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,...,C,90.0,"Cumings, Mrs. Florence Briggs (née Thayer)",35.0,"New York, New York, US",Cherbourg,"New York, New York, US",4,NaN,1.0
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,...,S,865.0,"Heikkinen, Miss Laina",26.0,"Jyväskylä, Finland",Southampton,New York City,14?,NaN,3.0
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,...,S,127.0,"Futrelle, Mrs. Lily May (née Peel)",35.0,"Scituate, Massachusetts, US",Southampton,"Scituate, Massachusetts, US",D,NaN,1.0
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,...,S,627.0,"Allen, Mr. William Henry",35.0,"Birmingham, West Midlands, England",Southampton,New York City,NaN,NaN,3.0

In [18]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'WikiId', 'Name_wiki',
       'Age_wiki', 'Hometown', 'Boarded', 'Destination', 'Lifeboat', 'Body',
       'Class'],
      dtype='object')

In [25]:
df = df.drop(['WikiId', 'Name_wiki', 'Age_wiki', 'Body', 'Lifeboat'], axis=1)

In [29]:
df.drop(df[df['Survived'].isnull()].index, inplace = True)

In [36]:
df = df.drop(columns=['Class'])

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    float64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     889 non-null    object
 11  Hometown     889 non-null    object
 12  Boarded      889 non-null    object
 13  Destination  889 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 97.6+ KB

In [40]:
df['Destination'].isnull().value_counts()

False    889
True       2
Name: Destination, dtype: int64

In [42]:
df.drop(df[df['Destination'].isnull()].index, inplace=True)

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  889 non-null    int64
 1   Survived     889 non-null    float64
 2   Pclass       889 non-null    int64
 3   Name         889 non-null    object
 4   Sex          889 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        889 non-null    int64
 7   Parch        889 non-null    int64
 8   Ticket       889 non-null    object
 9   Fare         889 non-null    float64
 10  Embarked     888 non-null    object
 11  Hometown     889 non-null    object
 12  Boarded      889 non-null    object
 13  Destination  889 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 136.5+ KB

In [57]:
df[df['Embarked'].isnull()].index

Int64Index([61], dtype='int64')

In [58]:
df.loc[61]

PassengerId                        62
Survived                          1.0
Pclass                              1
Name              Icard, Miss. Amelie
Sex                            female
Age                              38.0
SibSp                               0
Parch                               0
Ticket                         113572
Fare                             80.0
Embarked                          NaN
Hometown       New York, New York, US
Boarded                   Southampton
Destination    New York, New York, US
Name: 61, dtype: object

In [59]:
df.loc[61,'Embarked'] = 'S'

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  889 non-null    int64
 1   Survived     889 non-null    float64
 2   Pclass       889 non-null    int64
 3   Name         889 non-null    object
 4   Sex          889 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        889 non-null    int64
 7   Parch        889 non-null    int64
 8   Ticket       889 non-null    object
 9   Fare         889 non-null    float64
 10  Embarked     889 non-null    object
 11  Hometown     889 non-null    object
 12  Boarded      889 non-null    object
 13  Destination  889 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 136.5+ KB

In [61]:
df[df['Age'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Hometown,Boarded,Destination
5,6,0.0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,Q,"Cork, Ireland",Queenstown,New York City
17,18,1.0,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,S,"Harrow, London, England",Southampton,"Chicago, Illinois, US"
19,20,1.0,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,C,"Tebnine, Lebanon",Cherbourg,"Michigan City, Indiana, US"
26,27,0.0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,C,"Hadath, Lebanon",Cherbourg,New York City
28,29,1.0,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,Q,"Limerick, Limerick, Ireland",Queenstown,New York City
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0.0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,C,"Tebnine, Lebanon",Cherbourg,New York City
863,864,0.0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,S,"Peterborough, Cambridgeshire, England",Southampton,"Jacksonville, Florida, US"
868,869,0.0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,S,"Haaltert, East Flanders, Belgium",Southampton,"Detroit, Michigan, US"
878,879,0.0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,S,"Knezhni Lak, Troyan, Bulgaria",Southampton,"Chicago, Illinois, US"
888,889,0.0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,S,"Thornton Heath, London, England",Southampton,"New London, Connecticut, US"

In [66]:
df[df['Sex']=='male']['Age'].mean()

30.72664459161148

In [67]:
df[df['Sex']=='female']['Age'].mean()

27.915708812260537

In [80]:
idx = df[(df['Sex'] == 'male') & df['Age'].isnull()]['Age'].index

In [81]:
df.loc[idx, 'Age'] = 30.72

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  889 non-null    int64
 1   Survived     889 non-null    float64
 2   Pclass       889 non-null    int64
 3   Name         889 non-null    object
 4   Sex          889 non-null    object
 5   Age          889 non-null    float64
 6   SibSp        889 non-null    int64
 7   Parch        889 non-null    int64
 8   Ticket       889 non-null    object
 9   Fare         889 non-null    float64
 10  Embarked     889 non-null    object
 11  Hometown     889 non-null    object
 12  Boarded      889 non-null    object
 13  Destination  889 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 136.5+ KB

In [86]:
df.to_csv('/Users/marco/Desktop/titanic.csv')

In [85]:
df=df.drop(columns=['Ticket'])